{"meta":{"title":"The Solitorian","subtitle":"Another place for those who are historically solitary.","description":"News, Comments, Articles","author":"Sam Chang","url":"http://atreides.one","root":"/"},"pages":[{"title":"","date":"2023-10-18T01:32:21.423Z","updated":"2023-10-18T01:32:21.423Z","comments":true,"path":"about/index.html","permalink":"http://atreides.one/about/index.html","excerpt":"","text":"Historian. Early Modern China. Qing History. Digital Humanities. 关于当下和过去的简短思考。 旧博客依然在更新。这个博客只是单独提出其中有价值的部分，减少读者翻阅日记的困扰。 豆瓣日记功能和博客差得越来越远。 2020-02-16 由于豆瓣日记功能已经关闭，本站正式开站。"}],"posts":[{"title":"针对读秀图书的 Comic Enhancer Pro 设置一则","slug":"针对读秀图书的ComicEnhancerPro设置一则","date":"2023-10-17T15:42:10.000Z","updated":"2023-10-17T15:42:10.000Z","comments":true,"path":"/duxiu_cep/","link":"","permalink":"http://atreides.one/duxiu_cep/","excerpt":"不知道这软件干吗的就不用往下看了。 本文档仅针对读秀扫描图书，不涉及自扫图书。 读秀图书体积庞大，常见原因主要有三：页面大小设置不当，页面颜色灰度，以及一些劣化手段。优化瘦身的主要目的也正是为了改善这些问题。","text":"不知道这软件干吗的就不用往下看了。 本文档仅针对读秀扫描图书，不涉及自扫图书。 读秀图书体积庞大，常见原因主要有三：页面大小设置不当，页面颜色灰度，以及一些劣化手段。优化瘦身的主要目的也正是为了改善这些问题。 日常电子书处理，面对的文件主要是“一大堆字”仅有简单文字排版的普通书籍。对于这种书籍而言，需要保留的信息是原页照排的文字，而至于版面装饰、印刷细节都可以不必保留；大部分此类图书的文中插图也没必要在意，单页插图则可以直接保留整页，无需处理。因此，绝大部分此类普通书籍，都可以直接把页面设为黑白，没必要保留灰度。页面上各种花纹装饰也是能删就删。 这个设置要求你拿到DPI超过300的灰度扫描文件，习惯称为“高清”文件。“大图”或“快速”的文件处理效果不佳。 先上一个设置清单： 纠斜: 自动_横排, 边缘填白切边: 上&#x3D;0.6%, 下&#x3D;0.5%, 左&#x3D;0.6%, 右&#x3D;0.5%DPI&#x3D;600页面大小: 指定宽、高, 单位&#x3D;厘米, 宽度&#x3D;16.90, 高度&#x3D;23.90去除背景阴影: 5曲线调节: X1&#x3D;297, Y1&#x3D;-42, X2&#x3D;152, Y2&#x3D;296Gamma校正: 140多尺度细节增强: 39高斯模糊半径: 0.5缩放: 95%高斯锐化半径: 1, 阶数: 25USM锐化: 遍数&#x3D;3, 数量&#x3D;143, 半径&#x3D;172.0, 阀值&#x3D;122色彩设置: 色彩数&#x3D;纯黑白, 纯黑白（二值化）选项: 阀值算法&#x3D;Otsu, 去斑直径&#x3D;6, 去除与边缘接触的黑色区域, 边缘去毛刺 然后简单解释几句。 (1) 切边设置 纠斜选项按需设置，一般是横排，如果是竖排的话改一下。 一般不需要内容框，“手动选择范围内自动选择”复选框取消掉。 切边，我自己觉得薄切一层就够了（目的是切掉页面不正所带来的黑色边缘），因此四个方向都只切 0.5% 左右。 页面大小设置是重点。我选择的是指定宽高，具体数值基本上是按照 B5 纸的大小填写的，因为这是绝大多数“全是字的”书籍的开本。 DPI一定要改成 600 。提升DPI是优化的关键。 (2) 曲线把左下的方块拉到右下角，右上的方块先拉到最高，然后稍微往左一点。修改的时候，只左右微调顶上的方块，下面的基本不动。 这个设置的目的是让密集黑的部分尽量黑，然后微调找到那个平衡点，让边缘细节损失最小但噪点又没有显示出来。 (3) USM 锐化我照着网上的一个攻略写的。数量143，半径172，阈值122。 (4) 其他 “调节”按钮对话框里—— 高斯模糊 0.5 （这个设置可以让黑斑变大，如果文件笔画锯齿严重的话可以适当调大） 高斯锐化 1，阶数25 细节增强 最大 去除阴影 5 （这个设置是新版本里加的，效果贼拉好） “色彩”按钮对话框里—— 颜色填全黑白，“抖动”复选框取消掉（对全是字的书籍来讲抖动没啥用，你又不关心细节） 去斑直径我填的是6。实测这个数字大于8就有可能会把句号或者逗号消掉。 下面两个复选框都打勾。其中去除接触区域一项能消掉绝大多数黑边，但也有可能导致边缘的字被吃掉，一般如果不是文字死顶着页边的话就没事，如果真遇到死顶着的情况，就只能把这个勾去掉。 “去除符合下列条件的黑色区域”只在一种情况下需要填写——段中夹杂太多插图或是页面装饰里有大黑块的情况。大黑块不仅难看，还会导致文件占用空间上升。但这个选项误伤很厉害，尤其是扉页的大号汉字经常因此导致缺笔。如果需要填写的话，大概在200-300左右，两个都得填。 最后的保存格式一般选TIFF。 处理效果使用 PDF24 （强烈推荐）或 Adobe Acrobat 导出原书所有文件，用上述参数处理——CEP有个批量处理功能，非常好用——得到的TIFF图片大概每个文件 100-150 KB左右，平均下来，大概每本书的占用空间会缩小到(页数&#x2F;10)个MB。显示优美，在iPad上放大也不会有明显锯齿，而且因为是纯黑白，做笔记或高亮都方便，OCR识别效果也好，适合长期保存。 这个软件只能用来制作自己存档备用的文档，不能用来还原原书的样貌——你试一试就会发现字体细节变化很多，一眼就能看出来不是原书。毕竟，主要目的是用最小的文件尺寸最大程度保留原书版式下的文字。","categories":[],"tags":[{"name":"电子书","slug":"电子书","permalink":"http://atreides.one/tags/%E7%94%B5%E5%AD%90%E4%B9%A6/"},{"name":"技术","slug":"技术","permalink":"http://atreides.one/tags/%E6%8A%80%E6%9C%AF/"}]},{"title":"可以通读的清史史料举隅","slug":"可以通读的清史史料举隅","date":"2022-08-22T06:10:18.000Z","updated":"2022-08-22T06:10:18.000Z","comments":true,"path":"/qing_source_read\\","link":"","permalink":"http://atreides.one/qing_source_read/","excerpt":"这篇文章将就本人所知的范围，给出一些可以供学习清史的人通读，以初步了解清史史料学和清代文献风貌的代表性史料。 通读某些经典史料，是一个学习的过程而非研究的过程。通读的目的是对一类历史文献及其中所提示的信息有一种直观的认识。它和搜数据库、精读专题史料是两回事。 管见所及，通读一种信息密度较大的大部头史料，总会学到些以前“不知道自己不知道”的东西，这当然不适合用来“短平快”地写论文，但还是很有助益。另外，啃通一本书，会有愉悦感。 今天我们能读到的清代史料数量极其庞大，令无数清史学习者望而生畏。学习者往往慑于多种大部头文献的体量，不敢贸然试探，又或许一些历史文献虽然是珍贵史料，但由于诸多原因而不具备可读性，在具体研究中“精读”尚且不逮，对于学习者而言读起来事倍功半。 在此笔者仅凭个人见闻，综合文献阅读和获取两方面的难易度，对于一些篇幅、信息量、难易程度都对学习者比较友好的清代文献作一简单枚举，以便清史爱好者自行阅读和学习。管见所及，哪怕对一种原典稍微熟一点，在需要相关知识时都会颇有帮助。 本文只覆盖清人所编写的文献，不包括今人编写的文献。 另外想要强调的是，下面将要提到的大多数文献： 不用都看，挑感兴趣的看； 不用事无巨细地看，狗熊掰棒子，留下一点是一点，留下一点就够用； 看的速度可快可慢，快的话一种看几个月，慢的话一种看几年； 几乎都有易得电子版，但本文作者不会提供电子版，请大家自行寻找； 一般无需师长领读，自己就能看。","text":"这篇文章将就本人所知的范围，给出一些可以供学习清史的人通读，以初步了解清史史料学和清代文献风貌的代表性史料。 通读某些经典史料，是一个学习的过程而非研究的过程。通读的目的是对一类历史文献及其中所提示的信息有一种直观的认识。它和搜数据库、精读专题史料是两回事。 管见所及，通读一种信息密度较大的大部头史料，总会学到些以前“不知道自己不知道”的东西，这当然不适合用来“短平快”地写论文，但还是很有助益。另外，啃通一本书，会有愉悦感。 今天我们能读到的清代史料数量极其庞大，令无数清史学习者望而生畏。学习者往往慑于多种大部头文献的体量，不敢贸然试探，又或许一些历史文献虽然是珍贵史料，但由于诸多原因而不具备可读性，在具体研究中“精读”尚且不逮，对于学习者而言读起来事倍功半。 在此笔者仅凭个人见闻，综合文献阅读和获取两方面的难易度，对于一些篇幅、信息量、难易程度都对学习者比较友好的清代文献作一简单枚举，以便清史爱好者自行阅读和学习。管见所及，哪怕对一种原典稍微熟一点，在需要相关知识时都会颇有帮助。 本文只覆盖清人所编写的文献，不包括今人编写的文献。 另外想要强调的是，下面将要提到的大多数文献： 不用都看，挑感兴趣的看； 不用事无巨细地看，狗熊掰棒子，留下一点是一点，留下一点就够用； 看的速度可快可慢，快的话一种看几个月，慢的话一种看几年； 几乎都有易得电子版，但本文作者不会提供电子版，请大家自行寻找； 一般无需师长领读，自己就能看。 一、编年 蒋良骐：《东华录》。有中华书局1991年点校本。点校本约600页，记述开国到雍正朝史事。大量内容辑录自清代官修权威编年体史书《清实录》，对于研究者而言意义有限，但很适合学习者作为《清实录》节本阅读。 不推荐读《清实录》原书，因为篇幅太长、头绪太多。 二、典章 光绪《清会典》。有中华书局1991年缩印本。原书近2000叶。 这是本文最为推荐的一部史料。《清会典》系清代最权威的行政典章。清人五次纂修，其中康熙、雍正两朝《清会典》均采用叙述与条例夹杂的体例，乾隆《清会典》片面追求体例严整，可读性均不太好。嘉庆《清会典》修正体例，较为好读，又有凤凰出版社2021年标点本，但迄今未见电子书。因此推荐阅读较易获取的光绪《清会典》。中华书局缩印本仅一册，适合放在案头阅读。 《清史稿》诸志。中华书局标点本即可。 不要阅读《清会典事例》，因为篇幅太长、头绪太多。 不推荐阅读《清通典》《清通志》《清文献通考》。《清会典》并不难读，没必要读下游文献。 三、法律如果仅限纸质出版品的话： 乾隆《大清律例》，有法律出版社1999年标点本。原书约3000叶，标点本910页。 如果可以接受看在线电子文档，可以阅读薛允升《读例存疑》，较易获取的是在线版本 。 另外，柏桦主持编纂的《清代律例汇编通考》（人民出版社，2018年）以《大清律例》为纲，将司法类事例、成案等文献纳入其中，也是一种可以读的文献。但该书篇幅较长，约4000页，不适合急需基础知识的青年人。 四、档案 《清代文字狱档（增订本）》，上海书店出版社2011年标点本。大约1100页。 该书优点是，选用的档案一般是奏折、上谕等信息量较大的文件，整理者已经将档案按照案件的时间顺序整理好。读者可以跳过读档练习中最为痛苦的目录搜集、获取档案、辨认文字三个环节，先练习阅读正文，这样学习门槛比较低。而且本书中大多数案件中，档案讲出的故事相对比较完整，比同社的《清代档案史料选编》可读性要好。此外，本书大多数史料均令人不快，可供读者练习如何在读书时控制情绪。 《康熙朝满文朱批奏折全译》（大约1700页）和《雍正朝满文朱批奏折全译》（约3000页）。 笔者认为两书篇幅都太长，部分内容趣味性较高，但整体来讲信息密度比较有限。适合时间较为充裕且对康熙、雍正时期较为感兴趣的读者，一般青年学习者要量力而行。 《筹办夷务始末》（道光、咸丰、同治任选一朝，中华书局有标点本） 该书系清朝外交问题的官修史书，但内容多系直接抄录上谕、奏折，对于学习者而言也可以当档案整理本来读。优点与《文字狱档》类似，但本书并未按照事理分类，且篇幅太长，各朝都在三四千页左右，工作量较大。 五、政论 来新夏主编：《清代经世文选编》（黄山书社2019年标点本） 清代政论文汗牛充栋，仅《经世文编》便有多种。贺长龄、魏源辑录的《清经世文编》（岳麓书社《魏源全集》收录其整理本，5000页）篇幅已经太长，后来者更是读不过来。在此建议各位考虑一下来新夏先生主编的这个选本，大概1800多页，而且是标点本，读起来容易些，勉强还能看得完。本书电子版罕见，实体书索价数百元，也还在常人勉强能买得起的范围内。 六、传记这一类型难以推荐，大概勉强而言只有《清史稿》人物传记部分稍微好一点，选读一些名人的部分，跳过那些仅有履历罗列的人物。 其他如《满汉名臣传》《清史列传》都太长，《国朝先正事略》信息量太低。 七、笔记杂史 魏源：《圣武记》（中华书局1984年标点本） 记道光以前内外战事。 王庆云：《石渠余纪》（北京古籍出版社1985年标点本） 记清代财政经济问题大要。 中华书局《清代史料笔记丛刊》中大多数均可通读。其中可以优先读的书有这几种： 昭梿：《啸亭杂录》（中华书局1980年标点本） 吴振棫：《养吉斋丛录》（中华书局2005年标点本） 梁章钜：《枢垣记略》（中华书局1983年标点本） 赵翼：《檐曝杂记》（中华书局1982年标点本） 张集馨：《道咸宦海见闻录》（中华书局1981年标点本） 八、目录学笔者是外行。请参考这一篇豆瓣日记。 九、其他 《康熙起居注》（东方出版社2014年标点本） 清代起居注文献中，只有康熙朝起居注信息量较高，体现康熙时代君臣关系，值得一看。该标点本估计约4000页左右，但因为笔者通读过，觉得通读难度不大，故列于此。 暂时先想到这么多。","categories":[],"tags":[{"name":"清史","slug":"清史","permalink":"http://atreides.one/tags/%E6%B8%85%E5%8F%B2/"},{"name":"书单","slug":"书单","permalink":"http://atreides.one/tags/%E4%B9%A6%E5%8D%95/"}]},{"title":"西泽保彦《妄想代理》故事情节时间表","slug":"西泽保彦《妄想代理》故事情节时间表","date":"2022-01-18T15:33:12.000Z","updated":"2022-01-18T15:33:12.000Z","comments":true,"path":"/kalakuligatali\\","link":"","permalink":"http://atreides.one/kalakuligatali/","excerpt":"本文包括大量剧透。 本文作者不讨厌这部作品；但从NeoDB以及表瓣的评分来看，可能不满的读者还是大多数。本书的一大魅力是对情节的想入非非（“妄想”），如果读者对这种妄想能有共鸣，就能有比较好的体验。反之就会觉得烂。 本文系针对本书大部分情节的时间索引，不能作为剧情梗概。已剔除部分明显的妄想。本文以C和编号来标记章节号。例如C1对应《遗物》一章。方括号中为该情节出现的章节。对于一部分容易忽略的情节，会标出页码。本文依托于新星出版社2014年中译本。","text":"本文包括大量剧透。 本文作者不讨厌这部作品；但从NeoDB以及表瓣的评分来看，可能不满的读者还是大多数。本书的一大魅力是对情节的想入非非（“妄想”），如果读者对这种妄想能有共鸣，就能有比较好的体验。反之就会觉得烂。 本文系针对本书大部分情节的时间索引，不能作为剧情梗概。已剔除部分明显的妄想。本文以C和编号来标记章节号。例如C1对应《遗物》一章。方括号中为该情节出现的章节。对于一部分容易忽略的情节，会标出页码。本文依托于新星出版社2014年中译本。 重要物品 浅生唯人自撰日记，每月一本，共计5本。 加津江编造的唯人日记，每月一本，伦美发现时已经写了63本。 人物关系 浅生伦美，唯人之妹。毕业后去当地国立大学。毕业后进入浦部加奈子开设的浦部工作室打工。 浅生唯人，伦美之兄。高三第三学期刚开始、正准备参加高考时自杀。第一组日记的作者。C1死亡。 浅生加津江，浅生兄妹的母亲，第二组日记的作者，C7死亡。 下濑沙理奈，伦美的小学、中学同学。美女(p.10)。浅生唯人自撰日记中记载的关系者之一。后来去东京读私立大学。 国生真纪，伦美的同学。喜欢组织联谊。C2出场，C3、C5要角。C5死亡。 村山加代子，伦美的同学。后来上短期大学（p.36），元旦谋杀案第五名受害者。C2出场，C5要角。C5死亡。 近藤世绘，伦美的同学。C2出场且为要角。姓氏在C5揭出。C7死亡。 贞广华菜子，伦美的同学。毕业后在当地百货公司就职。起先与棹儿有关系，后来与棹儿之母加奈子有关系。C3出场且为要角。 相田贵子，伦美的同学。有预知梦的特殊能力。长相普通。C6要角。C6死亡。 鹈饲广亲，唯人的同学，C6出场，在校时与班主任顺子有关系，毕业去东京私立大学后断绝来往。此外与末次香织（诹访香）和相田贵子也都有关系。据说是很自恋的人。C6死亡。 梶尾顺子，在故事开始时41岁，高中生活课教师。“穿衣打扮既保守又老土。”浅生唯人自撰日记中记载的关系者之一。与班上学生鹈饲广亲有关系。C6死亡。 末次小夜，末次家老太太，和儿媳关系不好(p.7)，名字在p.106。元旦谋杀案第一名受害者。 末次嘉孝，末次家男主人，医生。包养佐光彩香。（p.104暗示与其母有不伦关系。） 末次夫人，医生。(p.103) 末次香织，艺名诹访香，末次家孙女，艺人(p.7)，伦美等人的小学同学(p.24)。元旦谋杀案第六名受害者。身材很好但长相普通（贵子认为）。 浦部棹儿，估计比伦美一班人小4岁。花花公子。华菜子的情人。C8死亡。 浦部加奈子，棹儿的母亲，钢琴教师。华菜子的情人。C8死亡。 藻原，加奈子的钢琴学生。 阿东，华菜子高中时的前男友，擅长柔道。 细川，20多岁，Sonight咖啡馆的服务员，在浅生伦美来访时接待(p.3)。 伊头志，Sonight咖啡馆的服务员，在伦美第二次来访时接待(p.17)。 佐光彩香，佐光阳志之妻，末次嘉孝情人。曾在Sonight咖啡馆当服务员。浅生唯人自撰日记中记载称为“佐光小姐”，不具名，亲吻但无关系。C4要角。C4死亡。 佐光阳志，C4要角。C4死亡。 佐光洋一，阳志和彩香的儿子，大学毕业工作，基本不回家。 北里二三枝，元旦谋杀案第二名受害者。 武市直美，元旦谋杀第三名案受害者。 谷部深雪，元旦谋杀案第四名受害者。 时间表5年前—— 浅生唯人和鹈饲广亲同年升入高中。[C1]（p.6） 4年前—— 梶尾顺子成为鹈饲广亲的班主任，两人开始发生关系。 3年前—— 9月1日，唯人开始自撰日记。[C1] 暑假中，沙理奈家被盗，家中照片全被偷走。 12月24日，唯人日记记载：家人出门，伦美去相田贵子家玩，他则与沙理奈共度一夜。事实：沙理奈参加了伦美、贵子的聚会，且和其他男生打得火热。[C1] (p.14) 2年前—— 1月8日，唯人自撰日记结束。[C1]（p.5）同日夜里，相田贵子梦见唯人自杀。[C5] 1月9日，唯人在少草寺上吊自杀。[C1]（p.5） 该年，广亲毕业，与顺子老师断绝往来。顺子老师在不甘中结婚。[C6] 1年前—— 佐光阳志被解雇。发现母亲患上老年痴呆症。[C4] 佐光彩香从Sonight咖啡馆离职。[C1]（p.4）晚间在酷玩快餐店工作以贴补家用（p.96）。不久与客人末次嘉孝私奔。[C5] 故事开始—— 1月1日凌晨，末次家老太太独居在老家祖屋，被杀，家中影集被盗走。次日被人发现。[C1] 1月1日，沙理奈参加真纪组织的新年看日出旅行联谊，但没看上男生。[C1] 1月9日，浅生伦美为体会唯人自杀前的心情，来到Sonight咖啡馆。她得知佐光彩香已经离职，以及末老太太次被杀事。[C1] 1月10日，伦美带着沙理奈来到Sonight咖啡馆。沙理奈说出小学时曾被唯人表白一事，伦美认定日记属于妄想。与测量仪对话后，打算把日记烧掉。[C1结束] 该年，伦美一班人高考。沙理奈考入东京某私立大学[C2]（p.37）。 第2年—— 1月1日凌晨，在沙理奈家附近街上，一名独居的中年女性北里二三枝（在市内点心店做工）被人用利器杀死。死者持有和沙理奈相同的小兔形状手机链。[C2] 1月5日，沙理奈参加高中同学聚会，聚会成员为男生5人、女生6人。女生包括：国生真纪、村山加代子、世绘、沙理奈。席上女生对男生未予礼遇。[C2] – 一个猜测：6名女生就是除了伦美以外的全部女子组成员，因为伦美高中毕业后并未回过老家（p.121）。 1月6日，沙理奈计划乘坐204航班返回东京，该班机被人预告有炸弹，被迫返航。沙理奈得知下一班1084次已经满员，决定死等204航班。稍晚偶遇被人骗到机场来的世绘。两人分别后，沙理奈接获1084次航班遭遇炸弹恐袭一事，随即被前晚聚会的男生恐吓。沙理奈在出租车上与测量仪对话，测量仪给出“犯人想让世绘登上1084航班”和“男人都是变态”的妄想，但被沙理奈戳破。沙理奈打电话安慰世绘不要想多。[C2结束] 12月24日夜，真纪在举办联谊活动后失踪(p.127)。华菜子与棹儿同居。[C3开始] 第3年—— 1月1日凌晨，市内一位独居的30岁OL武市直美在公寓停车场被杀。[C3] 1月中旬（即真纪失踪约3周后），棹儿声称真纪和藻原住在海边的独栋别墅里，要和华菜子探察。华菜子叫上阿东三人一起前往，无果。返回途中测量仪出现，留下“要想深一点”的妄想。[C3] 2月，真纪重新出现。据说是和十几个男生一起在别墅厮混数月。[C3]稍晚，华菜子约棹儿出来，让阿东埋伏擒住棹儿，逼问得知，棹儿和藻原试图以莫名其妙的“线索”引诱华菜子单独再去别墅探查、以便杀死泄欲。[C3结束] 3月末，村山加代子嫁入石井家。(p.36、p.125综合推理) 佐光彩香回到家中，发现佐光阳志收集的元旦谋杀案资料。测量仪出现，留下“阳志会搭车杀死陌生人”的妄想。[C4] 12月31日，佐光阳志在金子粮店外长时间逗留，听到测量仪的神秘声音留下“不能责备老人”和“忘记了自己做的事情需要翻报纸”的妄想。跟在后面的佐光彩香将阳志拉住。阳志已经认定自己是凶手，要杀死彩香。争执中两人被飞车党撞死，引发的火灾将金子粮店中的老太太金子美纱江烧死。[C4结束] 第4年—— 1月2日早晨，独居的护士长谷部深雪被发现死亡。[C4] 9月，沙理奈大四时回到高中母校，与另外6名同学聚餐。[C5] 席间真纪宣布订婚且要去宫内集团做秘书。加代子（406室）、真纪（506室）和宫内家小儿子夫妇（606室）都住在少草寺附近公寓“勒保罗·少草”。 10-11月之间某时刻，真纪目睹宫内夫人被关在门外。[C5] 12月上旬，真纪得知“勒保罗·少草”606室住户夫妇只有一个孩子，感到意外。[C5] 12月24日晚，真纪、贵子和佑一、哲郎两名男生在“勒保罗·少草”506室幽会。（后叙事的“真纪”于此时看到宫内家小儿子的淫行，但此一情节应系“真纪”的妄想，不能算数。）[C5] 12月31日，真纪返回娘家，直到1月3日。[C5]当晚，贵子梦见石井加代子被杀。[C6] 第5年—— 1月1日凌晨，石井加代子在“勒保罗·少草”406室的家中被杀。据石井先生的说法，他去洗澡，20分钟后出来的时候发现妻子死亡，门锁开着。[C5] 2月某日，宫内夫人坠落至506室。真纪揭穿宫内夫人的谎言后被杀。[C5结束] 12月30日，贵子梦见末次香织（诹访香）被杀。[C6] 第6年—— 1月1日凌晨，末次香织（诹访香）秘密回乡探亲时在家中被一个男人勒死。贵子认为是广亲所为。[C6] 1月5日，梶尾顺子在“TOP INN·御厨”与婆家人进行不太愉快的午餐后偶然闯入鹈饲广亲结婚现场，并遇见贵子。贵子解释她预知梦的能力，并提到广亲有编写性爱档案的恶劣爱好。此后贵子将顺子拉到郊外的老家空屋与召来的男生举行狂欢派对。当晚9点前后，鹈饲广亲在“TOP INN·御厨”被杀，贵子认为是末次嘉孝的复仇。[C6] 1月6日早五六点间，相田贵子向顺子解释前夜布置的缘由后被怒气大发的顺子杀死。顺子逃亡过程中掉入田中水沟溺死。[C6结束] 7月，伦美入职“浦部工作室”。稍晚，在家再次发现应该已经被销毁的唯人日记（即由母亲加津江撰写的第二组日记）。[C7] 12月31日，世绘与未婚夫一家前往夏威夷，沙理奈被父母带去高原度假地，华菜子和伦美在加奈子借给华菜子的房子里庆祝新年。未料，沙理奈一家乘坐的巴士发生爆炸，所幸乘客都已下车，幸免于难。[C7] 第7年—— 1月1日黄昏时分，世绘死于夏威夷的大型恐怖袭击。加津江手持唯人笔迹的解雇通知书死在家里，警方认为系自杀。[C7结束] 年初，沙理奈硕士毕业留在东京。[C8] 大约从年初开始，伦美开始以唯人的口吻撰写死亡后的“手记”，将一切案件归结为怨灵诅咒。[C8] 3月，华菜子、佳奈子和一名男子被棹儿射杀。棹儿随后自杀。[C8]（共度良宵系伦美的妄想，不能算数。） 6月，世绘等人的骨灰送回日本。伦美和沙理奈恢复联系后前往少草寺意图自杀，被沙理奈救下，“测量仪”给出“什么机关也没有”的结论。[C8结论]","categories":[],"tags":[{"name":"书评","slug":"书评","permalink":"http://atreides.one/tags/%E4%B9%A6%E8%AF%84/"},{"name":"推理小说","slug":"推理小说","permalink":"http://atreides.one/tags/%E6%8E%A8%E7%90%86%E5%B0%8F%E8%AF%B4/"},{"name":"西泽保彦","slug":"西泽保彦","permalink":"http://atreides.one/tags/%E8%A5%BF%E6%B3%BD%E4%BF%9D%E5%BD%A6/"}]},{"title":"新建獨立博客的一些想法","slug":"新建獨立博客的一些想法","date":"2020-03-01T14:48:48.000Z","updated":"2020-03-01T14:48:48.000Z","comments":true,"path":"/whyblog\\","link":"","permalink":"http://atreides.one/whyblog/","excerpt":"这篇日记很大程度上仅是把以前的数条豆瓣广播内容总结到了一起而已。如果你一直在看我的广播，那本文大部分内容可能你都见过。 与本文主题类似的文章在华语世界里其实司空见惯。本文所说并没有什么特殊。如果你认为本文令人失望，那么我将对您表示由衷的敬意，因为这说明您的阅读层次相当之高。 这篇文章并不是真正的技术内容——我相信大家不写博客不是技术壁垒。我只想为没考虑过独立博客的人指出一些上路的可能性。 另外本文也吸收了一部分豆友在各广播评论区里的反馈。在此对引用或未引用的豆友均表示感谢。","text":"这篇日记很大程度上仅是把以前的数条豆瓣广播内容总结到了一起而已。如果你一直在看我的广播，那本文大部分内容可能你都见过。 与本文主题类似的文章在华语世界里其实司空见惯。本文所说并没有什么特殊。如果你认为本文令人失望，那么我将对您表示由衷的敬意，因为这说明您的阅读层次相当之高。 这篇文章并不是真正的技术内容——我相信大家不写博客不是技术壁垒。我只想为没考虑过独立博客的人指出一些上路的可能性。 另外本文也吸收了一部分豆友在各广播评论区里的反馈。在此对引用或未引用的豆友均表示感谢。 关于为什么要建个自己的博客我在之前一篇博客文章里讲过一个观点，就是你如果仍然试图通过互联网来寻求表达思想、帮助思考，依然会愿意认真对待言论的话，那么你需要去减少阅读、撰写短内容而尝试长内容。然而，即便你没有经历过本世纪初有那么几年的“博客时代”，你也可以注意到，现在大多数带有一点社交性质的社区平台，你尝试在上面撰写深思熟虑的长内容，都会觉得有诸多不便。 需要强调的是，我这里说的并不只是敏感内容。你就算老老实实地写生活的感悟，风险也很大。举一个例子：对于大多数社区而言，你的帐号如果因为一些偶然因素（例如手机号换绑时出了什么差错，或是如同某社区那样大量“误封”用户）而“没了”，或许你可以建立新帐号、设法恢复一部分关注者，但你的长内容也是导不出来的。要是你在上面写过很多有趣的东西，这一下子几乎是要把你的生活清零。当然你可以选择自留底稿，但我觉得大多数人不打算这么干，毕竟我们今天都不全是为了自己而写作。——说白了，在现在我国网络精神生活越来越像游戏的情况下，你如果在“化内之地”认真，那受伤的一定是你；这和你是个什么人根本无关，只是因为各种有本事管你的人都已经遵从游戏化的大趋势、都不可能如你一样认真而已。 以前（博客时代刚刚消亡）大家遇到社区管理混乱的时候，往往会选择换个平台。但经历过豆瓣近一年来的奇怪管理的网友想必都意识到，这种换平台的把戏已经没得玩了，过去管理较为宽松的网站骤然进入紧张状态的时候只会比大社区更混乱。进一步讲，大社区因其在审查部门直接挂号而有些特殊待遇，小社区走回封闭冷落的老路，而那些不上不下的中型社区要么关门大吉，要么在审查机制的控制之下变为僵尸社区，用户想被统战都不得。与其玩各种深度猫逮耗子的游戏，浪费很多精力，不如去检讨一下我们对待社区的思路。社区不愿意认真你的心血，那你与其寄托给同样规则下的另一家社区，还不如自己玩。这就是独立博客。（我知道有人会说邮件组，这个事情更困难，要是独立博客也没得玩了再说。） 简而言之，以前作者的思路是：找个好使的社区，在上面直接写作，再分享到其他社区或者网站。但这在现在即便帐号（且不说单篇内容本身）也动辄就没了的情况之下，你优先应该抓住自己的内容——社区帐号没了还可以重建并重新呼朋唤友，只要你的内容还在，重建影响力就不困难。（当然，除非你就是想当个新闻转发机或者拱火小牛，这种情况下即便掌握内容也对你没什么帮助，反正你也不怎么需要比较深刻的思想。）说白了，独立博客的内容在自己的手里，你博客里可以更专心写作，而在社区只干两件事：(1) 分享链接出来，并 (2) 和那些“只用社区的轻度互联网用户”沟通。 你本该把更多的精力放在思考和写作上，不该把精力放在打哑谜、说黑话、改拼音、生成图片、倒转、涂花上。不得已而如后者一般行动，这是无可奈何，但如果有办法可以避免后者，你为何不尝试一下呢？ 此外，对于一些喜欢摆弄的用户而言，独立博客的可定制性一般会更好。豆瓣已经是目前主页定制功能最好的社区了（你们知道主页各模块是可以拖来拖去的对吧），大多数社区几乎没什么定制主页的空间。比如说，你在知乎，主页上就是你的个人时间线。假如你不想展示自己给人点的赞、只想给人展示你写过的专栏文章，那除了不给人提供账号而只提供专栏链接以外几乎没有任何办法。而很多独立博客网站上都可以自己定制主页显示的内容。 最后要说的是，我2008年开始用MSN Space（知道这个玩意的人恐怕都年纪不小了吧），写过一些蠢东西。后来，这玩意先改名Windows Live Space，接着被关闭，用户迁移到Wordpress或者网易博客，现在后者也没了。我在收拾自己博客的时候看到十二年以前我写下的生活和想法，这些文字在当时、在这段时间里、在当下都蠢得令人脸红，但我依然会回想起很多美好的事情。我要说的是，写博客并不是真的要有真知灼见，并不需要是专家教授，也不是非得有“从小学开始写作文就上范文”的文字水平。对于自身的生活和想法而言，你自己就是最专业、最真切的那个讲述者，也是最能理解作者思路的好读者。在写作中，你对自己的想法、对事物的理解都会得到梳理，这对你思维的组织大有好处；而在写作后，即便写得不好的文章，你在事后重读时都会感到不一样的意味。不要怕写得不好，在保护好自己隐私的情况下可以大胆写作。 不要怕技术问题我相信大多数朋友都跟我一样，语言理解能力还凑合，但计算机技能比较白痴。特别是如果你长期把工作重心放在阅读和写作上，计算机和网络的知识可能对你来说就像是健身一样，用“没时间”搪塞自己的禁区。但说实话，搞计算机、搞网络技术的网友们，在知识分享上的热情和实践，比起藏着掖着不说人话、昧着良心瞎说鬼话的文科生整体来讲还是高了很大一截的。 是的，你的各种问题几乎都在网上能找到现成的讨论。这里说的“各种问题”包括：某个错误信息是怎么造成的？博客应该黑底白字还是白底黑字？等等，你搜一下基本都能找到现成的答案。中文搜不出来就搜英文。 大多数技术问题，要么在服务提供方的文档里有写（例如github上托管的各种项目基本都有自己的wiki），要么有现成的别人的网站可以拷贝（github可以下载代码自己研究），要么在相关人员的技术博客里有现成的代码可以用，要么可以搜出答案。我以前从不知Linux下怎么修改文件内容，网上一搜，几分钟就学会了——我很笨，全靠谷歌。 网站会不会被屏蔽？那是不是很麻烦？我还是以自己为例。2010年寒假的时候我把自己的博客迁移到wordpress.com，然后寒假结束我返回学校，这时候发现了一件要命事：wordpress.com的服务器在美国，而我所在的学校，其校园网只允许访问“国内网站”，访问国际网站要加钱。这就意味着我没法登录自己的博客。沮丧之下随便瞎玩，居然发现了一个弱点：当时Windows Live旗下有个软件叫Windows Live Writer，可以在本地撰写一篇文档然后代为发布到指定博客网站，这个东西似乎是先通讯到微软自己在上海的服务器再发布出去的，因此如果发布时连接到的加速机房IP属于学校“国内网站”列表，那么就可以正常地发表博客文章。后来Windows Live Writer被微软干掉了，我打开了自己博客上的电子邮件发布文章的功能（Wordpress自带），往一个邮件地址写邮件就可以自动把正文当成文章发出来。说这个故事，是想讲一个道理：很多独立博客即便受到一些网络阻断的影响，也依然有办法写和读，需要开动脑筋。 具体而言，防火长城封锁网站时，有针对域名的，有针对IP的。有些时候服务商会阻断带有特定后缀的域名，例如wordpress家的免费域名*.wordpress.com就经常被防火长城、小宽带服务商或国产浏览器屏蔽，不予解析。但现在很多博客服务都支持你换绑自己的域名，如果你这么做了，那么访问就会通畅很多。而如果你自己置办服务器，问题自然更小，可以换IP然后把域名指向新的IP。 相比之下，你更应该考虑的是读者。毕竟大多数读者看到网站连不上，第一反应是不看了；而我想大家写作的本意肯定不是想把国内互联网轻度用户整个挡掉，毕竟互联网轻度用户不等于大脑轻度用户。我还记得，我有一次分享了自己的博客文章给我母亲，当时微信浏览器因为解析到了wordpress.com这个域名而强行终止连接，并提示“该网站有违法内容”——尽管那个网站上只有几篇小论文。母亲极为紧张，打电话问我是不是犯法了，这件事促使我一定要换绑域名。我不是特别主张大家非得热捧一些“肯定没法打开”的网站——除非你真的很喜欢。 是不是会影响我和网友互动？大多数博客框架拥有评论功能，有些需要注册帐号，有些只需要填个电子邮件就能留言。我的看法是，评论功能固然好，但没有也没啥（例如github+hexo的解决方案就是基本上没法评论的）。你可以拉到社区里分享的时候讨论，或者留个电子邮件地址让人跟你邮件讨论。反正千百年以来哲学家们都是靠书信沟通的。 我的观点：在当下这个环境下，大多数网友互动并不真的必需——同温层以内打气的话可以用点赞代替，同温层以外大部分人没法对话。如果你看了别人写的东西觉得不爽，一个比较理性的办法是自己写一篇东西去反驳。你可以看看微博等社交网站的评论区，看看有多少真的是有价值的沟通。我觉得无价值的对话及其展示是导致我们越来越沉溺于社交网络的原因之一。 最大的麻烦是分发：RSS，邮件乃至社区分享。社区不愿为麻烦的人保存内容，这是他们对长内容格外专断的根本原因，也是我觉得应该把长内容从社区转移出去的决定性原因。但公允地讲，社区对内容的推荐功能，往往对作者来说十分必要，不然没人来看你写的东西。你不能指望别人靠运气发现你这颗“遗珠”。 现在绝大多数读者不太可能每天起床后把认识的人的博客都巡礼一遍——尽管以前的人不乏此道，但现在这么干的大概只剩stalker了。每个独立博客的作者都是一方面不希望太多人来看、另一方面更不希望没人来看。为了避免后者的发生，你仍然需要一个社交平台来分享博客文章的链接。当然这不尽符合独立博客的本意。一来，社交平台掌握着很多个人信息，在社交平台上活动的stalker们也往往更不懂得如何和其他人保持距离、更愿意去翻人旧账，对作者来说不是很舒服。二来，现在很多社交平台（微博、知乎、豆瓣、etc）或者掌握推送能力的平台（头条等等）希望把内容抓在手里，对外部内容往往做或有意或无意的限制，例如不会推送很广、不提供预览乃至一定程度的限流等等。 很难说有什么更好的解决办法。我的建议是，如果你不介意博客访问量少，也不在意那些技术上不怎么灵光的读者（比如瓜鸡之类只会看垃圾内容的读者），那么就一定要开放RSS。同时，你也要多使用RSS来订阅朋友们的博客。毕竟大家都一把年纪了，写了博客已经不会有暗恋的人来默默关注了。 有人或许会说，我们可以贴出文字长图来达到传播的目的。但我觉得你近一段时间应该已经意识到，在微信、微博里贴文字长图给你带来的风险一点也不小。还不如贴确保能访问的链接。 另外，一些博客平台如Wordpress有一个特点是：作者可以用电子邮件来写作，关注者可以电子邮件订阅。这样即便官网被墙，或者自托管博客IP被屏蔽，作者和读者都无法访问网站本身（当然服务器得在），作者还可以继续写作（发送电子邮件），读者可以继续跟读（接收订阅电子邮件），甚至也可以传播。 好了，谈点实践的吧：怎么办？一些方案###(1) WordPress.com ## 如你所读到的那样，我是他家的老用户。这里要注意的是，wordpress本质上是博客框架，是一种技术，而wordpress.com则是wordpress官方自行托管的、使用wordpress技术的博客。网上搜索wordpress大多数结果都说的是这种技术，例如建站指南、插件使用心得之类，很少有说这个网站怎么样的——因为这个网站非常傻瓜，基本很少有人有问题。 基本原理是访问 https://wordpress.com ，注册账户，然后简单调教一下网站就可以开写。注意： 一定要使用 https 而不是 http ； 不要使用微信浏览器等国产浏览器（有可能会主动屏蔽）； 如果DNS解析不正常，可以修改hosts文件指定访问地址，一般没问题。 他家换绑自己的域名需要买 personal plan ，一年60美元。他家有个自带域名服务，吹得很凶，声称有自有后缀（TLD）.blog，可以包含在personal plan里云云。但其实这个域名只免第一年，第二年开始需要每年按$22&#x2F;年续费，有点小贵（毕竟自用域名有的只需要几美元）。我建议你要么只用免费版，要么买个personal plan然后换绑自己的域名。 另外他家提供数据导出服务，随时可以把站点大部分信息下载下来然后自己再建一个Wordpress博客导入进去。我试过，效果不错hhh。 ###(2) WordPress的自托管博客 上面说的wordpress.com是官方给你托管的，但你也可以自己在网络服务商如Vultr、Linode、DigitalOcean之类购买虚拟主机（shared host或VPS均可），然后安装Wordpress所需软件，自己搭建博客网站。一些服务商如Bluehost直接就出售定制好wordpress的shared host，还有一些如Linode家直接在买VPS时可以一键安装Wordpress。 当然，这种博客的定制性比Wordpress.com要更好——想想看，wordpress.com上想安装个插件，必须要购买business plan以上的付费计划，而这些站点都可以直接安装。 缺点是： 即便有一键安装，你还是要进入命令行设置证书（虽然也不麻烦，let’s encrypted家网站上有傻瓜版指南）。 价格。目前Linode家最便宜的vps一年也得$60，如果再用个Akismet（防垃圾评论）之类的服务就得继续加钱。再比如说你想挂个安全证书，费用也是可大可小。总之比wordpress.com 要贵。 国内一些网络暴力团伙喜欢以黑客攻击别人服务器为乐，概率问题，遇到了就很麻烦。设置CDN可以降低损失，但又得加钱。我的想法是反正博客内容都有备份，大不了把vps一删，重新架一个了事。 总之就是自己建站的话大多数问题还是要自己解决，虽然现在网上查起来大都不麻烦。（我自己建了一个，不过还没完全调试好，先不放地址了。） ###(3) 其他博客 我看到有朋友推荐了 https://write.as 、https://www.weebly.com 、 https://wix.com/ 三家。 第二家已经不能正常访问。第一家注册试用了一下，免费版可以满足一般写作需求，收费版$72一年，可以绑自己的域名。我觉得还不错。这三家的好处都是注册以后简单调教一下（比wordpress.com 还要简单）就可以直接开写。我没测有没有RSS，如果没有的话就不要用。 如果有其他好的博客网站或框架，也欢迎朋友们多写测评。 ###(3.5) Blogspot &#x2F; Blogger 谷歌旗下服务，官方托管的博客完全没法在大陆访问，不存在的。 有网友指出，可以通过同时换绑自己的域名（规避对blogspot域名的屏蔽）和利用站长工具寻找 ghs.google.com 域名的可用IP填入blogger后台，来实现免翻墙。我自己试了试，确实可行。 唯一的问题是，Blogger有点难看。 ###(4) github pages+hexo## 技术含量稍高。参见这一篇：https://zhuanlan.zhihu.com/p/26625249 我本人之前完全不会用github，照着这个指南一步步来，搭出来了这个博客： https://atreides.one 。只要严格遵循它的步骤，它没讲的东西就可以去看相关项目的wiki，应该不至于有啥问题。 我其实蛮喜欢这个办法的。不用掏钱（当然你得自己买域名），而且静态网页不怕打。 ###(5) 其他写作平台，如Matters 这些平台其实就是medium乃至简书的翻版，并不是真正的博客网站，和境内的社区没有太本质的区别。坦白讲，我并不喜欢这种文章平台。 文章平台大都要求文章有着传播上的意义，可其实我写博客大多数并不是要“写给别人转发”的，不希望那么多人来看，而是希望能在广为传播和绝对私藏之间。 Matters的互动性很强。它在去年的政治风波中承载太多的政治讨论，吸引了大量热衷于“网上论政”的境内网民。这让它也出现了如境内社交网络舆论场一样的缺点。说实话我不喜欢这样。我们大多数人上网讨论点什么，是业余生活的一部分，我们不能让这些讨论过多腐蚀我们的正常生活——而你在言论平台上和境内的网虫论政，结果只能是因为你投入精力不如对方多而落下风。 这些网站大部分不能正常访问，对读者而言不太方便。 同理，我也不会推荐各位去其他一些境外著名互动社区。 当然，这些网站也有明显的正面意义。我不反对有朋友喜欢它们，而且也很高兴看到他们在这些网站上找到自存之道。 ###(6) 短内容平台，如Twitter 我们就是为了减少短内容才不用微博的，何必“刚离虎口，又入狼窝”呢？ ##还得说说域名 当年——大概二十年以前，有一门大生意就是抢注域名。那年头上网冲浪的老鸟经常会吹嘘一些“域名就是名片”、“某某好域名卖了多少万”之类的奇谈怪论，大致就跟今人喜欢谈互联网大佬轶事一样。后来随着TLD（域名后缀）越来越多，域名也就逐渐没那么值钱了。 不过，如果你决心不再依靠社区的ID而转靠自己的网站来展示自己，那么很明显的一点是，你依然需要一个自己管理、带有自己印记，而且容易记忆的域名。这样，即便你的网站暂时无法访问，但只要你把域名指向新服务器或者新网站，你依然可以重建你的互联网存在，找回一部分朋友们。 目前关于域名服务商的测评在网上很容易搜到。我自己用的是 namesilo.com，支持支付宝。 .com域名大概$9一个，其他域名从每年十美元、二十美元乃至几百美元不等。你可以没事想想有什么好玩且便宜的域名。我知道有姓王的朋友去抢购.wang结尾的域名（不太推荐，这个域名貌似得去阿里旗下的万网注册），也是很好玩儿的。 当然，如果你是博客新手，我建议你先注册一个免费博客写着玩儿，玩爽了再考虑域名。 总之，对于还愿意在网上投入一些严肃且认真的情绪的人，我的建议是： 尽快开一个自己的博客； 养成随便写点儿什么的习惯（但要注意保护隐私）； 引导朋友们用RSS和邮件订阅的方法关注，也可以在社交网站贴出链接； 玩熟了就可以考虑付费购买高级别服务、绑定自己的域名。 作为文章的结尾，我想重复一下我劝大家开博客的初衷： 你可以多为自己的精神世界做些事情，而不是让情绪由别人摆布； 你完全应该多关注社会和心灵，它们真切的本身，而不是互联网热议的“社会”和“心灵”； 你需要读和写冷静的长内容，而不是喧嚣而瞬间即逝的短内容； 社交平台帐号生死越来越随机，你需要一些地方来保持不变的东西，需要一个域名来保证自己活在网络世界的某个角落； 与决心相比，技术壁垒不是那么困难。","categories":[],"tags":[{"name":"如何自处","slug":"如何自处","permalink":"http://atreides.one/tags/%E5%A6%82%E4%BD%95%E8%87%AA%E5%A4%84/"},{"name":"社交网络","slug":"社交网络","permalink":"http://atreides.one/tags/%E7%A4%BE%E4%BA%A4%E7%BD%91%E7%BB%9C/"},{"name":"数字难民","slug":"数字难民","permalink":"http://atreides.one/tags/%E6%95%B0%E5%AD%97%E9%9A%BE%E6%B0%91/"},{"name":"博客","slug":"博客","permalink":"http://atreides.one/tags/%E5%8D%9A%E5%AE%A2/"},{"name":"教程","slug":"教程","permalink":"http://atreides.one/tags/%E6%95%99%E7%A8%8B/"}]},{"title":"互联网舆论场上的骂架话题，无关真实","slug":"骂架话题无关真实","date":"2020-02-27T15:34:08.000Z","updated":"2020-02-27T15:34:08.000Z","comments":true,"path":"/netvoicenotmatter\\","link":"","permalink":"http://atreides.one/netvoicenotmatter/","excerpt":"我们这个时代面对的一个很大的思想困境就是一切都在被互联网舆论场所绑架。这不仅是说我们更多地使用互联网上大型互动社区来发表、分享和吸收观点——当然这也确实是个问题，以后再展开说——也不单纯指我们的消息源往往是一些试图或者已经在互联网舆论场上占据一席之地的意见领袖（或曰大V），而是说，读者，连同读者的信息源（也就是意见领袖们）试图去理解问题的方式高度服膺于一种只在互联网舆论场上才得到认同的思维方式，同时也只用互联网舆论场上才有意义的方式提问；而那种实现互联网舆论和真实世界当中的观念、言论、声音之间的转换的接口，则并不总是（或许不该说得这么委婉，而应该说是“经常不”、“几乎不”）以建设性的态度忠诚地作业，这令我们这个时代的思想和观念被整个割裂了：你如果想要吸收知识和观点就必须要上一些大多数人都在上的网站，但你只要上多一点这些网站，你就逐渐变成了一种只在、只会在、只会以它的逻辑在网上思考的人，而这和现实也许无关。它的一个结果就是你把思想的实践变成了和无关痛痒的人或观点的争斗。It is nothing，真的。","text":"我们这个时代面对的一个很大的思想困境就是一切都在被互联网舆论场所绑架。这不仅是说我们更多地使用互联网上大型互动社区来发表、分享和吸收观点——当然这也确实是个问题，以后再展开说——也不单纯指我们的消息源往往是一些试图或者已经在互联网舆论场上占据一席之地的意见领袖（或曰大V），而是说，读者，连同读者的信息源（也就是意见领袖们）试图去理解问题的方式高度服膺于一种只在互联网舆论场上才得到认同的思维方式，同时也只用互联网舆论场上才有意义的方式提问；而那种实现互联网舆论和真实世界当中的观念、言论、声音之间的转换的接口，则并不总是（或许不该说得这么委婉，而应该说是“经常不”、“几乎不”）以建设性的态度忠诚地作业，这令我们这个时代的思想和观念被整个割裂了：你如果想要吸收知识和观点就必须要上一些大多数人都在上的网站，但你只要上多一点这些网站，你就逐渐变成了一种只在、只会在、只会以它的逻辑在网上思考的人，而这和现实也许无关。它的一个结果就是你把思想的实践变成了和无关痛痒的人或观点的争斗。It is nothing，真的。 无关事实的争论：语境和资讯前几年我曾经参与过一次说大不大、说小不小的公众事件。有一家自媒体公众号在网上找到了一个胡说八道的人，把这人哗众取宠拿出来吹嘘的事迹当了真，遂写出了一篇“十万加”的“扒皮文”，以此为出发点对性别问题发表了一些议论。我和一位友人私下里聊了几句，都认为这个人说的并非事实。然而我俩出来解释此事疑点后，收到的却是公众号相关人士、各种拱火人士和他们的粉丝们潮水一般的举报、反对和无中生有的攻击。我们过往说过的话、行文习惯乃至错别字等等都被逮住猛攻，对方或言辞阴阳怪气或满口歪理，网站也不予处理。我被人折腾了半个上午，情绪比较激动，逼自己离开计算机前，走去吃午饭。当天天气其实算不上很好，我走在路上，看到周围行色匆匆的行人从我身边走过，就跟每日的中午没有什么非常大的不同。这一瞬间我突然意识到，尽管过去的一个多小时里我接收到了无数的信息、跟一些人进行了看似很重要的辩论，尽管我刚刚顶了无数的牛角尖去关注了许多所谓的“事实”，但这些对于现实生活、对于不上这个网站的大多数人而言，并没有任何的意义，或者说它们并不关乎真正的事实。由此为契机，我开始去审视我们现在在网上谈论的事情，和真实的世界是否有关。 每个社会议题都有它比较核心的争论点，这一点想必读者都可以理解。当我们试图作出一段论述时，往往也会从争论点来发力。然而理性的讨论者不会忽视问题的完整性与切实性——那就是我们要研究的议题，有着明确的关怀，或是社会层面，或是思辨之中。当议题被过度化约为争论点时，这些关怀便从某种程度上离场了，丧失了讨论的本真性，将对话变为脱离语境和社会背景的文字游戏。而我们现在面对的情况，恰恰是在互联网上各种对话、讨论和争议都在变成高度化约以后的舆论场战争。参与者不再试图了解问题的全貌，而仅是试图了解有哪些可以用于攻击对方的“论据”、“话术”等武器。这种讨论是无关现实的，只是满足参与者抬扛打幡儿的乐趣而已。 严肃的讨论必须要依靠有畅所欲言的讨论环境、足以“明目达聪”的资讯供给和通情达理且忠实可靠的讨论者，这三者在现在的互联网上全都找不到。审查机制令讨论必须字斟句酌且小心避开诸多雷区。而由于调查媒体的消亡，防火长城导致境外媒体的报道无法传入境内，以及各级舆论管控机制对少数独立媒体的打压，事实上我们的资讯世界已经高度变形，供给的资讯对于持不同的观点的人来讲并不是公平的。或者说，用来为讨论提供论据的“事实”并不是真实的事实，它只是一种在当下还能够存在和传播的舆论材料而已。这一点可以继续展开，日后当专论。 被互联网传播学驯服的讨论者相对而言，讨论者的情况要复杂一些。我在这里想要提出的一个观点是，互联网舆论场对讨论者的改造相当彻底。论者往往并不关心事实，而只关心一些仅仅在互联网舆论场上才能得到解释的片段和迷因；这一关照无关乎智性、社会现实与人类未来，而只关乎互联网传播学和网络暴力的需求。 中文互联网舆论史发展二十余年，沉淀下来大量关于既往议题争论过程中你来我往的故事。这些故事，作为经验性事实，基本只和过往参与争论的人及争论过程本身有关，而与过往争论中是否展示出有助于思考的内容无关。换言之，了解这些故事，只能让你沉迷于一些已经消失的过往云烟，却无助于了解问题。 互联网传播学当中的另一个特征加剧了这种错位感，那就是梗文化的滥用。前面说过的这些经验性事实往往被提炼为大量的网络迷因，以迷因文化的传播规律而进一步蔓延，完成对讨论空间的占领。我们不难看到议题的消解：例如一个国内革命战争的讨论，一定会夹杂有许多声音在反复使用如“光头”“凯申物流”“矮子”等并不明确代指，他们并不是真的有什么洞见，而只是在炫耀这些迷因，并吸引那些同样没有灼见、只知道一些梗，急于寻找同类的其他网民而已。十分明显的是，迷因本身并不代表见解和思想，它对事实的意义只在互联网舆论中才能得到解释——“蒋公”和“常凯申”，他们的实指是一样的，仅指一个现实中的人物，但互联网上的读者却会聚焦于这些名词所带来的舆论战阵营意义，进而将前者划定为敌人，而把后者看成自己人。显然这种划分对于了解现实没有任何帮助，但我们可以看到有大量的讨论都是基于这类不知所云的词语，并且发声者乐见自己的内容为之所充斥、甘愿以它为本体。在发声者看来这是呼唤朋辈、寻找友人的手段，但我们也必须要指出的是，这种内容也因此而只能被视为是一种舆论场上的社交游戏，与现实无关。 互联网传播学的第三个特征则彻底将语言与社群固化在了一起，即以舆论场争论中求取上风为目的的、社群化的网络暴力及其尝试，这也就是舆论场的争斗。社会、文化、历史、政治、经济乃至兴趣爱好、生活方式、艺术品味等等都在这一对话语境中丧失了具体的含义，而仅仅是为参与者寻找网络暴力施加对象的诱饵。网民们通过这些诱饵，捕捉迷因，寻找自己可以加入的社群以及自己可以以此来施暴（或者暂时不能施暴、等待加入社群后再行施暴）的对象。这构成了互联网上大多数争斗的实在——例如袁崇焕的历史评价问题，本来只是很小的事情，但由于它牵涉了百度贴吧里几伙网民之间关乎虚荣的争斗，而一再升级，变为了互联网热议的历史问题。这些问题的讨论目的只有一个，那就是令某一方取得上风，求取虚荣；迷因是社群的标记，化约了的事实成为网络暴力的契机，而事实本身则消解了。 这种社群化讨论的虚妄性还可以继续谈两点。其一，社群没有明确的外在界限，也经常没有明确的内部等级机制。边缘网民事实上并不因参与斗争而获得更高地位或取得更多特权，无等级的不安定感促使网民更多地团结在社群核心——也就是意见领袖身边，加剧了讨论“对人不对事”的倾向。其二，这些讨论总是向着脱离语境的单纯网络暴力或现实中的暴力演变。毕竟争论并不能定出输赢，而羞辱对方的人格、销掉对方的账号、展示对方的隐私乃至攻击对方的身体，更接近于这种社群争斗的本质。强力机构的资源（网警、在官媒新媒体团队的朋友、能帮忙查户籍的警察等）在争斗中非常抢手，而写手、思想者反而是不重要的。 目前很多泛时政类话题下能说得上话的意见领袖大V都有自己的粉丝群，人数一般在几十人到一二百人之间，一些大号可能会是这个数字的数倍，例如有一位大V的tg群有千余人。一个个的粉丝群构成了社群的基础，铁粉在其中炒热气氛、帮助分析形势，引导边缘网民出动去实施舆论战。边缘网民则在这一过程中得到了虚幻的归属感。 而关于这种社群化的“事实”无关乎真正事实的虚妄性，也依然可以展开谈一点，那就是为争斗占上风而制造的虚假事实（“造谣”）。在这一斗争中，用“事实”所支撑的言论只是用来尝试霸凌对方的工具，因此只要能够提高成功的可能性，发声者往往毫不犹豫地选择要求真实性服从于斗争之中的可用性，也就是为了实现言语暴力而编造谣言。这些言论的目的只是为了避免因出现漏洞而遭到反击，而且发声者自己往往也毫无信用可言，可以在多次网暴中调适自己的话语，因而所表述出的内容即便无法被证伪，经常也是无关真实的。例如尝试证明东林党压制商业的言论，总能调适到无法被证伪，找到某些深文周纳的线索，但无论它说什么，都不具备现实意义，它只是为了压服对手而制造的话佐料。 上述这些因素拼合为了一幅中文互联网的讨论图景。我们从来都不缺乏这类案例：一旦有人试图谈环保问题，就一定会有聪明人想要找出Greta可以批评的传闻来反呛；一旦有人试图谈女性问题，就一定会有人贴什么“一共真女权”——这些作出反映的人并不真的关心社会问题，他们只在乎自己是否得胜，是否能够在“话头子”上压倒发论者（以此确定自己在舆论场上具有地位），是否与另一些大V站在了一起。如果你试图和他们辩论，那么你得到的一般都不是对话，他们、他们身后的大V及其粉丝们，秃鹫早已静待多时，毕竟他们当中不乏拥有一些官媒新媒体团队供事的朋友来“挂”你，也不乏警察朋友可以查户籍、删帖子、销账号。这就是一场永不停息的网络暴力的盛宴。 这一机制的进一步演化即是关于社会、政治、经济等事情的讨论的彻底消解，大V彻底从中抽离，变得只知道和事实之间有着可疑联系的网络迷因。我们现在也不缺这样的人，他们作为新媒体运营人才进入了各大官媒新媒体团队之中，利用自己在互联网舆论中的生存技巧，配合官媒账号背后无可监督的言论权力来进一步加剧网络暴力的危机。我们从去年开始已经看到多件类似的例子：负责运营官媒新媒体账号的人，拿着公家的大号出来耍横。读者以为这是官方的声音，其实只是一个学历很低、只会混舆论战圈子的人的个人看法。我们也可以看到，这类新媒体运营人士往往只知道一些舆论战的切口，例如一提国民党统治就会说花园口等等，这些在相关议题中并没有那么重要，它们的重要性只有在互联网舆论战互相攻讦的语境中才能得到认同，而这些人也就只知道这些。当然这是件很蠢的事，而它正在发生。 闭锁的讨论圈以上的分析，是希望导出这样的一个结论，那就是现在中文互联网舆论战哺育了一种特殊的人和语境。这种语境之下你不可能去期盼有什么真正的对话，你也不可能把每个读者都认真对待为真正的讨论者。你必须要谨慎地选择你的讨论对象，并且控制你的讨论范围和情绪，因为那些胡搅蛮缠、拒绝沟通、拒绝思考、口诛笔伐的人根本就无意来和你对话。这是问题的一个方面。 而问题还有另一方面。在上述语境之中，通过互联网文本内容（例如各大平台类似博客的文章、帖子、微博等短内容等）所提出的各种“事实”，无论是来自权威媒体还是大V见闻，其意义性都在丧失，因为不仅资讯是不公平的，连发声者的发声理由也是没有公共讨论意义的。例如很多仇女大V每天都在分享各种攻击女性的帖子、微信公众号文章之类，他分享这些就是求取一种简单的感官享受。你无法和他展开讨论。同理，一些由学养较差的人运营的学术机构新媒体号，会发表一些明显有学术错误但指向较为简单的煽动性结论的内容，虽然看起来有权威背书，但其实也是没有讨论意义的，而且你事实上无法与之争辩——不要忘了，你的对手拥有网络暴力资源。 写长内容，不要关注无聊事有人觉得本文所述的这种严肃讨论消解之后的虚妄性没什么大不了，这些读者当然可以保留他们的意见。我见过一些朋友，他们在思考和上网之间平衡得相当好，上网就是跟人打屁闲聊；但更多的朋友，无论是认识的网友还是一些不认识但十分痛苦的朋友，我想都是做不到这种平衡的。这就是为什么我要写这篇博客。 我在这里反复强调互联网舆论场所绑架的讨论的虚妄性，正是希望大家能够在筹划应对之道时能够把它和本真的智性追求相切割。我的看法是，在互联网上讨论严肃问题的语境已经被舆论战深刻影响的情况下，坚守智性的唯一方式就是尽量远离那些只在舆论战内部才能呈现的事情，以及坚执于这些事情的人。 我希望读者能够去重新布局你所关注的话题，试着不再关心一些互联网舆论场的无聊事，例如某些意见领袖之间打打闹闹或者恰没恰饭，某些标签化的议题如明清、国共、白左黄右什么的出没出黑料，等等。我自己的评价标准是，我会默默想一想，自己会不会把这个话题解释给我太太？关于智性的就可以讨论，而那些羞于启齿的就不会。 而从形式上讲，我的建议是减少一对一的沟通（如评论区里对话或有针对性地反复纠缠式回应）、短内容的交流和无意义内容的倾泻，因为这些最容易被谙熟于舆论战老手们利用，用来把思考者搞得晕头转向、筋疲力尽而言不择词。而且目前短内容平台的封闭性较强，不易时候检索，短内容本身也难以有条理地为后人所理解。短内容的另一个缺陷是，文本的短促当然可以提高对话的节奏，但它也令本身的意义更依赖于互联网舆论的语境，这是我们着力避免的。 与此对应地，你应该尽量把你的思考撰写成系统的、有条理的长内容。撰写长内容如博客文章时，作者有更多的自律可以用来检视自己的思想，梳理自己的逻辑，这对作者和读者来说都是有利的。而且长内容有助于后人检索、引用和继承，这些才有可能变成真正关乎智性的精神资源。事实上，当你试图撰写长内容时，你会慢慢意识到过去用来在短内容互动的语境下所使用的思维逻辑是多么糟糕、讨论的事情有多么无聊。 而且你应该找到一个稳定的地方来保存自己撰写的长内容，例如独立博客。毕竟境内现在已经逐渐不存在什么可以让你安安稳稳写字的地方了。 我提这些建议的目的，归根结底还是为了让读者您能够有健全的身心去面对需要洞察力和判断力的重大事宜。毕竟，如果每天都在和人打嘴仗，那么你一定会对那些本该投以重视的社会变革失焦。","categories":[],"tags":[{"name":"言论平台","slug":"言论平台","permalink":"http://atreides.one/tags/%E8%A8%80%E8%AE%BA%E5%B9%B3%E5%8F%B0/"},{"name":"如何自处","slug":"如何自处","permalink":"http://atreides.one/tags/%E5%A6%82%E4%BD%95%E8%87%AA%E5%A4%84/"}]},{"title":"不要太拿Troll当回事","slug":"troll账号的作用被夸大了","date":"2020-02-21T10:36:19.000Z","updated":"2020-02-21T10:36:19.000Z","comments":true,"path":"/trollisnotsth\\","link":"","permalink":"http://atreides.one/trollisnotsth/","excerpt":"所谓Troll，在wiki上有相当周详的解释：大概而言，Troll指的是那些利用发表煽动性内容或者无关离题内容来激起读者情绪化反应，从而转移读者注意力、淡化讨论主旨的人。目前似乎也没有什么好的翻译，很多人习惯性地将它译作网络喷子，我觉得不是很翔实。喷子这个词只强调了Troll言辞粗鲁对他人作人身攻击的特点，但实际上攻击性只是Troll违反社交礼仪行为当中的一部分，还有很多例如胡搅蛮缠、哗众取宠、信口雌黄、垃圾话等等，都没有包括在里面。而且在中文互联网上，troll还有很多其他的表现形式，常上网的人都能理解，这里不再多解释了。我觉得与其寻找一种很好的定义，各位读者不妨去想象一下《哈利·波特》系列里最著名的一只troll——就是第一册《魔法石》里被哈利等人在地下室敲晕的那个巨怪，个头大，呼噜噜，臭烘烘，粗鲁无礼，脾气暴躁，走哪儿撞哪儿，见谁打谁。 如果你经常关注言论平台，那么你大概不太可能忽视troll；如果你关注时政或者历史、政治、军事之类话题，你也许还会觉得寻找troll是一件上网打屁的过程中必不可少的话题。而如果你是内容生产者的话，我想你肯定或多或少都被troll困扰过，他们有的人在评论区胡说，有的人写文章、拍视频等等公然歪曲你的看法，还有的人则会采取人肉、设陷阱、举报之类的办法来害你。我想很多内容生产者都会对此心有戚戚。 最麻烦的一点是，troll的言论——正如其定义所言——带有很强的吸引力，会让读者对你的看法的理解整个跑偏，而且这种跑偏很容易带有一种“民意”的错觉。当troll的言论激发起读者的情感反应后，往往会引起许多人在这一路径上做出反应，进而产生一种近似于“众声喧哗”“七嘴八舌”的感觉。而troll在这一过程中享受到了生活中难以博得的关注。在这一舞台上，troll取代了作者，成为了作者舞台上的主角，而且troll及被他煽动起来的读者则暂时地享受到了貌似“多数”的虚幻“主流”“民意”的自我满足。而一部分评论者（乃至颇有权威的下定论的声音）也会认为这种troll所制造的喧哗是一种“人民的眼睛是雪亮的”的结果。","text":"所谓Troll，在wiki上有相当周详的解释：大概而言，Troll指的是那些利用发表煽动性内容或者无关离题内容来激起读者情绪化反应，从而转移读者注意力、淡化讨论主旨的人。目前似乎也没有什么好的翻译，很多人习惯性地将它译作网络喷子，我觉得不是很翔实。喷子这个词只强调了Troll言辞粗鲁对他人作人身攻击的特点，但实际上攻击性只是Troll违反社交礼仪行为当中的一部分，还有很多例如胡搅蛮缠、哗众取宠、信口雌黄、垃圾话等等，都没有包括在里面。而且在中文互联网上，troll还有很多其他的表现形式，常上网的人都能理解，这里不再多解释了。我觉得与其寻找一种很好的定义，各位读者不妨去想象一下《哈利·波特》系列里最著名的一只troll——就是第一册《魔法石》里被哈利等人在地下室敲晕的那个巨怪，个头大，呼噜噜，臭烘烘，粗鲁无礼，脾气暴躁，走哪儿撞哪儿，见谁打谁。 如果你经常关注言论平台，那么你大概不太可能忽视troll；如果你关注时政或者历史、政治、军事之类话题，你也许还会觉得寻找troll是一件上网打屁的过程中必不可少的话题。而如果你是内容生产者的话，我想你肯定或多或少都被troll困扰过，他们有的人在评论区胡说，有的人写文章、拍视频等等公然歪曲你的看法，还有的人则会采取人肉、设陷阱、举报之类的办法来害你。我想很多内容生产者都会对此心有戚戚。 最麻烦的一点是，troll的言论——正如其定义所言——带有很强的吸引力，会让读者对你的看法的理解整个跑偏，而且这种跑偏很容易带有一种“民意”的错觉。当troll的言论激发起读者的情感反应后，往往会引起许多人在这一路径上做出反应，进而产生一种近似于“众声喧哗”“七嘴八舌”的感觉。而troll在这一过程中享受到了生活中难以博得的关注。在这一舞台上，troll取代了作者，成为了作者舞台上的主角，而且troll及被他煽动起来的读者则暂时地享受到了貌似“多数”的虚幻“主流”“民意”的自我满足。而一部分评论者（乃至颇有权威的下定论的声音）也会认为这种troll所制造的喧哗是一种“人民的眼睛是雪亮的”的结果。 最近发生的一件事也是这一局面的很好的验证。在罗新教授的访谈发表后，中古史研究公众号收到了很多不友善的评论。公众号管理员随后将这些留言截图单独发表——可以看到，很多人并没有认真阅读或理解罗新在说什么，而是凭借一种本能发表一些离题和情绪化的言论。这毫无疑问是一种本真的troll。类似这样的困境，恐怕每一个热爱思想的人都曾在自己发表言论后遇到，它会让思想者去怀疑自己是否正确、是否可笑，进而对自己的行为作自我规制。 我的看法完全相反。在我看来一些谩骂或嘲笑的声音之所以十分醒目，只是因为它们troll的行为激起的情感反应比一般人要多而已，并不能说明什么民意。这不是一篇论文，我只阐述我的观点并配必要的解说，不会罗列多少数据。 首先一个质疑点就是人数。我相信，所有认为“troll代表民意”的持论者，一个最直观的论据就是众声喧哗的“众”字。例如一些带有一锤定音能力的媒体每当试图说明“看到大家都在骂你我就开心了”的时候，总是会配上评论区的截图，展示一排排谩骂的微博帐号，以显示这种声音人多势众。然而这一看法是站不住脚的。尽管看起来队形再整齐，但一条微博骂的人大概顶多也几百、几千，如果算进中国人口里，大概真的只是一个零头而已。考虑到算法推送原则，你觉得一个几百几千转发的微博能有多少人看到呢，看到的人又有多少会放弃跑出来炫耀一下道德优越感的机会呢？把这个比例算上，你也可以想象，troll言论的数量和赞数都只是看到它的人里的一小部分。 我们还可以进一步展开一下，假设微博上一万个在政治、历史类话题上比较有影响力、发声比较自由的用户，每天发5条微博，那么每月就有150万条政治微博；假设每条微博下面有10条高赞谩骂回复，大概就是1500万条回复。而微博现在日活大概是4亿多，算下来所谓民意也只占到总用户的3%而已。 当然这并不是非常合乎逻辑的估算。我想要强调的是，几千条谩骂的言论，高赞评论后面几千的赞数，这在视觉上或许很有冲击力，但要说成民意就未免有点儿夸大了。 何况这些回复有大量都不是真人。举一个例子。微博上有位用户“红盾局长克里斯”曾在疫情初现之时将一些与防疫有关的事项总结为五条，声称这五条缺一不可。这条微博评论区的评论条数很多，我去看的时候有数百，来自不同的用户，且都有很多赞；但仔细阅读会发现这些评论都在声称要维护中国统一、要求止暴制乱、打击港独势力，等等。稍有阅读能力的人都会发现评论区和微博说的完全不是一件事，显然，只是因为这条微博中的一些词语与香港去年发生的政治事件中的若干关键词在字面上相合，触发了评论机器人抓取关键词的机制，让很多机器人误认为这是一条与香港有关的微博而自动开始发表预设好的机械回复，仅此而已。我们无需去猜测这是什么人干的，毕竟很多程序员都会想利用这些机制来训练自己的模型。我在这里提这件事，是想说，我们可以由此看到troll言论的生成机制——很多troll言论都是模式化的，预先作为语料库内置在程序之中，机器人自动抓取言论往外喷。面对面的真诚交流需要很复杂的词句，但常见的troll言论则不是这样，那些煽动性或令人窝火的语句如“收了多少钱”“是汉奸，鉴定完毕”“没什么用”“太长不看”之类，罗列几十几百条，并不困难。这些语句可以通用地回复给很多微博、微信、知乎回答乃至b站弹幕之类。显然，这些troll言论如果当成民意，就太可笑了，毕竟暂时机器人还没有人权。 或者我们可以换个直白一点的说法：你每天看到的很多简单回复都不是真人。当你看到你写的内容下面冒出不说人话的评论者，或者你觉得某一篇文章的评论区里有许多志同道合的人，那么你第一反应完全不必是觉得自己错了，而是应该想想为什么自己这一条内容下面会变成机器人训练语言模型的沙盘。顺便说一句，机器人并不只限于计算机自动脚本，一些情况下，也会有真人完全按照语料库来干这些事情，我觉得可以统一视为机器人，毕竟这些人也没什么自由意志。 进一步来谈，troll言论之所以能够吸引到很多注意力，很大程度上应该归因为它是troll言论，而不是理性且符合礼仪的言论。一方面，troll言论往往带有明显的煽动性，或是明显不和主内容共情，也或许它本身包含不需智性即可理解的内容，再或许它表现出一些虽然离题、但在常识上异常容易取得共鸣或政治上异常简单的涵义，这些都能让它更吸引人们注意。而troll们在尝到被关注的甜头以后，就越发上瘾——这就是所谓的troll会不断加剧自己troll的行为，变成互联网舆论界里的小白鼠，而稍有智性，或有自己生活的人，即便一度从troll行为中找到快乐，也会逐渐因厌倦而离开。沙汰之下，我们就看到了现在互联网世界里的奇景：troll们到处乱喷，理智的人懒得跟他们讲理，只设法筑自己的堤坝。 我在这里讲这些看法，并不是为troll辩护，也无意来追究troll背后是不是有什么势力。毕竟美国的许多社交网站也饱受troll遍地的困扰，这本就是人类的本性；越无礼的人越大声，也是社交圈子里的一大常识。我的意思是，在现有的互联网舆论管制形式之下，肯定有一些troll行为因为某些原因而得以大行其道，作为内容生产者，或者思想者，或者追求智性之路上的求索者，你能够不要因为troll而改变自己的观点、怀疑自己的人生、伤害自己的感情，也不要在troll身上浪费很多时间（你无法真正改正一个troll，只能他自己救自己，真人troll的行为往往不是因为知识的缺乏而是因为智性缺失，这是网上几句闲聊教不好的）而是去做自己该做的事情，学习，工作，研究，传播知识和思想。","categories":[],"tags":[{"name":"言论平台","slug":"言论平台","permalink":"http://atreides.one/tags/%E8%A8%80%E8%AE%BA%E5%B9%B3%E5%8F%B0/"},{"name":"如何自处","slug":"如何自处","permalink":"http://atreides.one/tags/%E5%A6%82%E4%BD%95%E8%87%AA%E5%A4%84/"}]},{"title":"我对逃离微信宣言一文的保留意见","slug":"我对逃离微信宣言一文的保留意见","date":"2020-02-18T10:27:55.000Z","updated":"2020-02-18T10:27:55.000Z","comments":true,"path":"/freefromwechat/","link":"","permalink":"http://atreides.one/freefromwechat/","excerpt":"","text":"Matters上前几日有人（帐号为freefromwechat，应系专门注册）刊发《 逃离微信宣言 》一文。近因友人推荐而找来读了一下。我一直是微信的反对者，但客气地讲，这篇“宣言”说得并不太好。 “宣言”并未指出微信的诸多决定性缺陷，如对搜索引擎关闭、诸多功能与公开互联网隔绝、公众号文章URL中记录大量用户信息、非移动端功能长期得不到重视等等。 一些指责是对的，例如审查机制不透明，但谈得非常隔靴搔痒。我的观感是，作者并未真的搜集足够多的关于微信封闭性的资料；本文所引用的文献和外部链接非常少，仅有境外帐号发言不可见这一件事，这在微信的缺陷中属于细枝末节。 关于微信公众号文章的评论区是否能促成“公共讨论”这一点，以目前境内哗众取宠、扣帽子、打棍子等骚扰行为十分普遍的状况而言，也许开放评论区也并不能改进讨论环境，而会给作者带来更多困扰。 此外，作者也没有明确地试图将微信的产品自身缺陷与其他干涉微信用户体验的因素剥离开来。事实上，关于微信的言论审查、以言入罪，归给产品自身缺陷，可能很勉强。尽管在用户一侧，逃离微信并不需要这么细分的理由，但这作为论述而言肯定是不应当的。 作者花了许多篇幅强调telegram的优势，但在目前境内舆论环境管控的大背景下，以及骚扰、举报和哗众取宠都非常多见的“小气候”中，一味强调telegram是不可取的。毕竟，即便仅仅组建一个telegram群聊（还不知道会说些什么），都会被微博上政治话题的大V当成“反华势力”煽动不明真相的群众围攻、举报、骚扰。何况本文还希望读者能把某几张带有二维码的图片分享到微信上，这种“宣示”对于大多数读者而言恐怕风险未免太大了，能找到的同温层远不足以抵消因此带来的可能的恶果。 这篇文章虽然在指责微信，但和气一点讲，它在文句风格、段落排布、逻辑结构上，都深受微信公众号所带来的新文风的影响。想要超越微信，喊口号、转一些危险的图片恐怕没什么用——作为个体而言，你必须真的去放弃一种社交生活；作为一种运动的倡议者而言，你必须去设法更明白地阐明微信在生活一些方面上的无意义性。","categories":[],"tags":[{"name":"微信","slug":"微信","permalink":"http://atreides.one/tags/%E5%BE%AE%E4%BF%A1/"},{"name":"言论平台","slug":"言论平台","permalink":"http://atreides.one/tags/%E8%A8%80%E8%AE%BA%E5%B9%B3%E5%8F%B0/"},{"name":"写作","slug":"写作","permalink":"http://atreides.one/tags/%E5%86%99%E4%BD%9C/"}]},{"title":"皇上敛财为哪般？——评赖惠敏《乾隆皇帝的荷包》","slug":"皇上敛财为哪般","date":"2017-09-27T13:11:36.000Z","updated":"2017-09-27T13:11:36.000Z","comments":true,"path":"/wallet_Qianlong_review\\","link":"","permalink":"http://atreides.one/wallet_Qianlong_review/","excerpt":"本文系对赖惠敏《乾隆皇帝的荷包》（中华书局，2017年）的书评。 雍正元年，两江总督查弼纳曾有一件奏折，称：“査得两淮盐商每岁给臣衙门之礼银二万两，随封银四千两。……倘若不收取，则白白便宜了富贾豪门，于诸商贩亦为不利。故每年此之二万银两，臣照收不误，送交内库，以备皇上赏赐之用。 ”雍正帝当即在夹批中回绝：“此不可也。尔留下用于公务，果诚无用，则数年为一段陈情，缮本具奏，予尔议叙。朕绝不担私受省臣贡银之名，虽可百般伪装巧饰，但帝王所行，名留天下万世，岂能隐瞒。” 然而雍正帝的继任者显然不是这么想的。在赖惠敏教授撰写的这部著作中，我们看到，乾隆帝毫不迟疑，利用内务府人员掌握的权力，从政府诸项收入中千方百计地为自己的“荷包”争取更多的款项。而且这位“十全老人”不仅会“挣”，还很会花。京城和热河大片的佛寺，成群结队的蒙古喇嘛，无休无止地做着法事，都是皇上的内帑为之赞助。","text":"本文系对赖惠敏《乾隆皇帝的荷包》（中华书局，2017年）的书评。 雍正元年，两江总督查弼纳曾有一件奏折，称：“査得两淮盐商每岁给臣衙门之礼银二万两，随封银四千两。……倘若不收取，则白白便宜了富贾豪门，于诸商贩亦为不利。故每年此之二万银两，臣照收不误，送交内库，以备皇上赏赐之用。 ”雍正帝当即在夹批中回绝：“此不可也。尔留下用于公务，果诚无用，则数年为一段陈情，缮本具奏，予尔议叙。朕绝不担私受省臣贡银之名，虽可百般伪装巧饰，但帝王所行，名留天下万世，岂能隐瞒。” 然而雍正帝的继任者显然不是这么想的。在赖惠敏教授撰写的这部著作中，我们看到，乾隆帝毫不迟疑，利用内务府人员掌握的权力，从政府诸项收入中千方百计地为自己的“荷包”争取更多的款项。而且这位“十全老人”不仅会“挣”，还很会花。京城和热河大片的佛寺，成群结队的蒙古喇嘛，无休无止地做着法事，都是皇上的内帑为之赞助。 对于一般的读者而言，本书最令人感兴趣的无疑是上篇，亦即皇帝的敛财手段。赖惠敏通过广泛撷取清宫档案中的奏销册、户科题本与大臣奏折，试图廓清内务府的财源，并结合案例来解释皇帝如何将这些财富转移进来。这一篇共分为四章，分别探讨内务府所属旗下地亩（即“官庄”）、内务府人员任职的榷关、内务府开设的当铺及贷给商人款项所带来的收入，以及盐商对皇室财政的贡献。 如果一名读者将这四项财源的情况稍加梳理，便不难发现，它们的获取与经营彼此有异。乾隆帝依靠抄没参革官商的资产积累了大片田地，例如查抄承安家产一案便令官庄面积翻倍。但是官庄靠天吃饭，且从本书所揭示的案例来看，官庄的管理亦属困难。相对来讲，各关上缴的款项，以及乾隆中叶的盐商、“发商”所缴交的税课、利息，则比旗地收入要稳定得多。 根据赖惠敏在书中所述，内务府获得上述稳定款项，主要是两种方式的结果。其一，内务府人员担任榷关、盐政相关职位时，为博主子欢心，将办公经费或应用于地方支出的款项从“公家”转而呈缴给皇上的“小金库”——这意味着未来不得不加重税收以补用度，而且也暗示着地方下级吏役的合法收入愈无保障。其二，内务府将自己的资金强行交给商人收取高额利息。虽然年利率本身看起来并不很夸张（6%到18%不等），但复杂的计利方式、混乱的“代摊”“分赔”和漫长的计利时间则给“皇商”们添加了无穷无尽而又无法预知的负担。除此之外，乾隆三十三年两淮盐引案中，皇帝更不顾既往缴交情况，指定额度，要盐商分赔。 可以看到，内务府在经营上并无高招。官庄到底有多少地亩，连内务府自己也搞不清楚。庄头屡屡破产，最后不得不交给地方官代为管理。而发商生息之事，内务府从未考虑“边际效益”，以为高额投入必然换来等比例的高额回报。他们能财源广进，其实完全是附着于乾隆帝本人随心所欲的意志，亦即无可监御的政治权力。至于这种权力的后果，皇帝本人是不感兴趣的——我们看到，乾隆后期“发商”与盐商已颇难为继，破产者屡见，但皇帝对此似无多少同情，甚至还要求未破产者帮摊其应缴款项。而部分积欠的解决，更是“按引摊派”，转嫁给了所有吃盐人。 与上篇相比，下篇的内容对一般读者来讲会显得陌生一些，而且似乎也显得不那么重要。毕竟藏传佛教在包括我在内的大多数读者看来并非民生要务。但事实上，下篇可能更接近赖惠敏撰写本书的原意。作者在此梳理了北京和热河地区的寺庙修造，并考察了寺庙经济情况，包括喇嘛的供养、寺庙收入的来源、蒙古王公的布施等等。这些考证指出，乾隆帝动用内帑修建了大量的藏传佛教寺庙，广召蒙古喇嘛入驻各寺，还以内务府经费资助了花样繁多的宗教活动。 然而喇嘛们个人的收入却呈现出很有趣的局面。作者指出，下层喇嘛有粮饷收入，由户部和地方州县拨给，但这一收入十分低微，较之八旗官兵要少，仅够个人基本生活。甚至还有许多喇嘛没有被编入粮饷之中，例如各寺有许多长期驻京僧人，数量超过了户部的标准，便无从领取俸饷。其结果是，寺庙高度依赖寺庙所属的牧厂及垦种地亩（这些收入和旗地一样不可靠）以及蒙古信徒的布施。这里还有地域上的差异：北京宫廷诸寺必须依靠皇帝的法事，不然就会像外城诸寺那样几乎坍废；热河与蒙古的寺庙，为了谋求政治上的利益，又必须购置贵重礼物来京运作，博取皇帝欢心。政治上的联系与喀尔喀王公来京朝觐的经济利益一起，让蒙古地区中上层人士连接到了清朝的国家机器上。 这里有一个十分有趣的现象：热河诸寺也是有“执事喇嘛”长期在京应付朝廷各机构，办理喇嘛粮饷事务，替寺里“活动关系”。换句话说，喇嘛也有驻京办（！）。 总而言之，皇上掏钱建寺做法，招来一堆喇嘛，但怹老人家可不管养，要靠蒙古人养。喇嘛们自行经理产业的能力也不强，来自蒙古信徒们的支持成为藏传佛教信仰维系的重要因素。而在这一过程中，清朝政府收获的则是草原的秩序：数千年的草原势力，现在经济上受制于北京-蒙古-俄罗斯的贸易体系和供养庞大的寺庙众僧，政治与文化上又不可避免地被北京吸引，反叛的可能性受到了严重的削弱。而清方在修造寺院上的庞大开支，换来的是，热河兵防经费非常之少，甚至低于江南驻防之费——因为真正的防御性开支在别处。在我看来，这一结果的导出，正是赖惠敏撰写本书的意旨所在——蒙古为什么衰落？过去人们可能会提到债务关系导致穷困、疫病的盛行等等，但都缺乏实证。从本书所揭示的内容来看，清朝政府有效地利用自己不无笨拙之处的国家机器富有主动性地把握了这一过程，代价是长城以内地区人民数以百万计的财富。千百年以来的中原王朝，在财政尺度上或许可以与此相比，但效果却远不能比肩。这是清朝的重要成功，也是“皇帝的荷包”的目的。 应该说，赖惠敏此书所考虑的问题是很大的，尽管我相信多数读者都更倾向于将它作为一部盘点皇室财政的著作，但事实上皇上的账簿只是它的一部分。 当然，赖惠敏的工作是值得后辈学人赞赏的。本书的前言中历数所涉及诸项档案的来由，颇多曲折，亦值得清史学生们作为内务府档案史料学的参考。 本书最大的缺陷在于作者的段落组织方式。作者阅读了大量的档案、收集了许多案例、作了充分的笔记，但在将这些笔记与资料长编连缀成文时，则显得过于随意。有四种现象在书中反复发生，其一是类似的内容重复出现（比如下篇第五章就多次出现关于内务府进项的讨论，这些讨论前面说过了）；其二是未加分类与提炼的案例连缀，例如第三章和第四章经常罗列许多关于款项归还的争论，但对于这些案例为何要放在这里则不加解释；其三是小标题与内容关系不大，例如第六章第五节题为“清政府对北京寺庙空间的控制”，但节中所述其实是蒙古商会的成立和运营；其四是一些地方存在“车轱辘话来回说”的现象，未能将逻辑理清。 较之段落上的有欠锤炼，行文上的问题对可读性的影响更大一些。作者对档案文献十分谙熟——这当然值得肯定——但她所面对的读者却大多数是对清朝档案与国家机器（特别是旗下体制）缺乏了解之人，在涉及专业内容时可能还是需要多作出一些解释。例如文中多次径直使用奏折档案中的术语，“拨给”“借领”“剩余”等等，这些词语在奏折中使用是一回事，但在现代汉语中则是另一回事，主动和被动方往往和档案中是不同的。当然，和这本书的史料投放量相比，这些问题都是小事，都属于“假以时日便可改进”的工作。","categories":[],"tags":[{"name":"政治史","slug":"政治史","permalink":"http://atreides.one/tags/%E6%94%BF%E6%B2%BB%E5%8F%B2/"},{"name":"清史","slug":"清史","permalink":"http://atreides.one/tags/%E6%B8%85%E5%8F%B2/"},{"name":"财政史","slug":"财政史","permalink":"http://atreides.one/tags/%E8%B4%A2%E6%94%BF%E5%8F%B2/"},{"name":"书评","slug":"书评","permalink":"http://atreides.one/tags/%E4%B9%A6%E8%AF%84/"}]}],"categories":[],"tags":[{"name":"电子书","slug":"电子书","permalink":"http://atreides.one/tags/%E7%94%B5%E5%AD%90%E4%B9%A6/"},{"name":"技术","slug":"技术","permalink":"http://atreides.one/tags/%E6%8A%80%E6%9C%AF/"},{"name":"清史","slug":"清史","permalink":"http://atreides.one/tags/%E6%B8%85%E5%8F%B2/"},{"name":"书单","slug":"书单","permalink":"http://atreides.one/tags/%E4%B9%A6%E5%8D%95/"},{"name":"书评","slug":"书评","permalink":"http://atreides.one/tags/%E4%B9%A6%E8%AF%84/"},{"name":"推理小说","slug":"推理小说","permalink":"http://atreides.one/tags/%E6%8E%A8%E7%90%86%E5%B0%8F%E8%AF%B4/"},{"name":"西泽保彦","slug":"西泽保彦","permalink":"http://atreides.one/tags/%E8%A5%BF%E6%B3%BD%E4%BF%9D%E5%BD%A6/"},{"name":"如何自处","slug":"如何自处","permalink":"http://atreides.one/tags/%E5%A6%82%E4%BD%95%E8%87%AA%E5%A4%84/"},{"name":"社交网络","slug":"社交网络","permalink":"http://atreides.one/tags/%E7%A4%BE%E4%BA%A4%E7%BD%91%E7%BB%9C/"},{"name":"数字难民","slug":"数字难民","permalink":"http://atreides.one/tags/%E6%95%B0%E5%AD%97%E9%9A%BE%E6%B0%91/"},{"name":"博客","slug":"博客","permalink":"http://atreides.one/tags/%E5%8D%9A%E5%AE%A2/"},{"name":"教程","slug":"教程","permalink":"http://atreides.one/tags/%E6%95%99%E7%A8%8B/"},{"name":"言论平台","slug":"言论平台","permalink":"http://atreides.one/tags/%E8%A8%80%E8%AE%BA%E5%B9%B3%E5%8F%B0/"},{"name":"微信","slug":"微信","permalink":"http://atreides.one/tags/%E5%BE%AE%E4%BF%A1/"},{"name":"写作","slug":"写作","permalink":"http://atreides.one/tags/%E5%86%99%E4%BD%9C/"},{"name":"政治史","slug":"政治史","permalink":"http://atreides.one/tags/%E6%94%BF%E6%B2%BB%E5%8F%B2/"},{"name":"财政史","slug":"财政史","permalink":"http://atreides.one/tags/%E8%B4%A2%E6%94%BF%E5%8F%B2/"}]}